Repository: muhammadusmantech/funxtion_pipline
Catalog: funxtion-ui-sdk/lib/l10n/app_*.arb
Languages: pl

# hintSearchText
source: Workouts, trainers, exercises
pl: Ćwiczenia, trenerzy, ćwiczenia

# yourTrainingPlan
source: {length, plural, =1{Your Training Plan} other{Your Training Plans}}
pl: {length, plural, =1{Twój Plan Treningowy} other{Twoje Plany Treningowe}}

source: See all
pl: Zobacz wszystkie

# recentTitle
source: {title, select, video{Recent Video Classes} training{Recent Training Plans} workout{Recent Workouts} search{Recent Searches} visit{Recently Visited} audio{Audio Classes} other{no found any}}
pl: {title, select, video{Ostatnie Lekcje Wideo} training{Ostatnie Plany Treningowe} workout{Ostatnie Ćwiczenia} search{Ostatnie Wyszukiwania} visit{Ostatnio Odwiedzone} audio{Lekcje Audio} other{Nie Znaleziono Żadnych}}

# recentSubtitle
source: {title, select, training{Sweet sweet plans} workout{Some fresh content for you} other{not found any}}
pl: {title, select, training{Słodkie Plany} workout{Świeża Zawartość dla Ciebie} other{Nie Znaleziono Żadnych}}

source: Next up
pl: Następny

# whatLookingFor
source: What Are You Looking For?
pl: Czego Szukasz?

# titleText
source: {title, select, video{Video Classes} training{Training Plans} workout{Workouts} audio{Audio Classes} audios{Audios} videos{Videos} other{not found any}}
pl: {title, select, video{Klasy wideo} training{Plany treningowe} workout{Treningi} audio{Klasy dźwiękowe} audios{Nagrania dźwiękowe} videos{Filmy} other{nie znaleziono}}

# cancelText
source: Cancel
pl: Anuluj

# clearText
source: Clear
pl: Wyczyść

# hintSearchText2
source: Yoga, HIIT, cardio
pl: Joga, HIIT, cardio

# levelText
source: Level
pl: Poziom

# instructorText
source: Instructor
pl: Instruktor

# equipmentText
source: Equipment
pl: Wyposażenie

# buttonText
source: {title, select, play{Play class} startWorkout{Start Workout} letsGo{Let's go} previous{Prev} nextWorkout{Next Workout} startFollow{Start Following} other{not found any}}
pl: {title, select, play{Odtwórz Lekcję} startWorkout{Rozpocznij Trening} letsGo{Zaczynamy} previous{Poprzedni} nextWorkout{Następne Ćwiczenie} startFollow{Zacznij Śledzić} other{Nie Znaleziono Żadnych}}

# resetText
source: Reset
pl: Resetuj

# filterText
source: Filter
pl: Filtruj

# doneText
source: Done
pl: Gotowe

# goalText
source: Goal
pl: Cel

# bodyPartText
source: Bodyparts
pl: Części Ciała

# alertBoxTitle
source: Start workout out of sequence?
pl: Rozpocząć Trening Poza Kolejnością?

# alertBoxBody
source: Any incomplete workouts listed before this one will be marked as complete.
pl: Wszelkie Niekompletne Treningi Wymienione Przed Tym Zostaną Oznaczone Jako Zakończone.

# alertBoxButton1
source: Cancel
pl: Anuluj

# alertBoxButton2
source: Start Workout
pl: Rozpocznij Trening

# alertBoxTitle2
source: Quit workout?
pl: Zakończyć Trening?

# alertBoxBody2
source: You will not be able to resume the workout.
pl: Nie Będziesz Mógł Wznowić Treningu.

# alertBox2Button2
source: Quit
pl: Zakończ

# alertBoxTitle3
source: Unfollow training plan?
pl: Zatrzymać Obserwację Planu Treningowego?

# alertBoxBody3
source: If you unfollow the training plan all progress will be removed
pl: Jeśli Zatrzymasz Obserwację Planu Treningowego, Cały Postęp Zostanie Usunięty.

# alertBox3Button2
source: Unfollow
pl: Zatrzymaj

# phaseTitle
source: {title, select, warmUp{Warmup} training{Training} coolDown{CoolDown} other{no found}}
pl: {title, select, warmUp{Rozgrzewka} training{Trening} coolDown{Schładzanie} other{Nie Znaleziono}}

# workoutText
source: Workout
pl: Trening

# getReadyForText
source: Get ready for
pl: Przygotuj Się Na

# getReadyText
source: Get Ready!
pl: Przygotuj Się!

# durationText
source: Duration
pl: Czas Trwania

# typeText
source: Type
pl: Typ

# whatYouNeedText
source: What you'll need
pl: Czego Będziesz Potrzebować

source: Up next
pl: Następne

# roundText
source: ROUND
pl: Rundy

# exerciseText
source: EXERCISE
pl: Ćwiczenie

# overviewText
source: Overview
pl: Przegląd

# trainerNotesText
source: Trainer notes
pl: Notatki Trenera

# trainingAll
source: All
pl: Wszystkie

# trainingFollow
source: Followed
pl: Śledzone

# workoutPluraText
source: {length, plural, =1{workout} other{workouts}}
pl: {length, plural, =1{Ćwiczenie} other{Ćwiczenia}}

# followingText
source: Following
pl: Śledzenie

# nextText
source: Next
pl: Następne

# completeText
source: You’ve completed
pl: Ukończyłeś

# totalDurationText
source: Total Duration
pl: Całkowity Czas Trwania

# progressUpdateText
source: Progress update
pl: Aktualizacja Postępu

# completedFollowPlan
source: 'You have completed the training plan and it will be removed from your followed training plans. If you wish to follow it again you can click “Start again” below.
pl: Zakończyłeś Plan Treningowy i Zostanie On Usunięty. Jeśli Chcesz Zacząć Go Ponownie, Kliknij „Rozpocznij Ponownie” Poniżej.

# startAgainText
source: Start again
pl: Rozpocznij Ponownie

# unFollowTrainingPlanText
source: Unfollow training plan
pl: Zatrzymaj Obserwację Planu Treningowego

# scheduleText
source: Schedule
pl: Harmonogram

# nothingToLoadText
source: Nothing to load
pl: Nic do Załadowania

# workoutOverviewText
source: Workout Overview
pl: Przegląd Treningu

# workoutCompletedText
source: Workouts completed
pl: Treningi Ukończone

# popupText
source: {title, select, show{Show info} here{Go here} other{no found}}
pl: {title, select, show{Pokaż Informacje} here{Tutaj} other{Nie Znaleziono}}

# itemTypeInfo
source: {title, select, single{Exercises can be combined into multiple sets with different metrics connected to it.} circuit{A time-based circuit is a combination of exercises performed with a prescribed work-rest interval. Each round can have a different work-rest interval and/or different exercises.} reps{A repetition-based circuit is a combination of exercises performed with short rest periods between them for a set number of repetitions. Each round can have a different number of reps, rest interval, and/or exercises.} ss{The concept of a superset is to perform 2 exercises back to back, followed by a short rest (but not always).} rft{RFT is short for 'rounds for time'. Participants need to complete the set amount of rounds and reps as soon as possible. A round is a sequence of all exercises. The time it takes the participants to complete the set number of rounds is their score.} amrap{AMRAP is short for 'as many reps as possible'. Participants need to complete as many repetitions of the given exercise sequence in a set amount of time. The total number of repetitions completed is the participant's score.} emom{EMOM is short for 'every minute on the minute'. In this type of workout, the participant has to complete the exercises at the start of every minute for a set number of minutes. Each minute can have different exercises with different values.} other{no found} }
pl: {title, select, single{Ćwiczenia można Łączyć w Wiele Zestawów z Różnymi Metrykami Połączonymi Z Nimi.} circuit{Obwód Czasowy to Kombinacja Ćwiczeń Wykonywanych w Określonym Interwale Pracy-i-Odpoczynku. Każda Runda Może Mieć Inny Interwał Pracy-i-Odpoczynku i/lub Inne Ćwiczenia.} reps{Obwód Oparty na Powtórzeniach to Kombinacja Ćwiczeń Wykonywanych z Krótkimi Przerwami Między Nimi przez Określoną Liczbę Powtórzeń. Każda Runda Może Mieć Inną Liczbę Powtórzeń, Interwał Odpoczynku i/lub Inne Ćwiczenia.} ss{Koncepcja Supersetu Polega na Wykonaniu 2 Ćwiczeń Bezpośrednio Po Sobie, Po Czym Następuje Krótka Przerwa (Ale Nie Zawsze).} rft{RFT to Skrót Od 'Rounds for Time'. Uczestnicy Muszą Ukończyć Określoną Liczbę Rund i Powtórzeń Jak Najszybciej. Runda To Sekwencja Wszystkich Ćwiczeń. Czas, W Jakim Uczestnicy Ukończą Określoną Liczbę Rund, Jest Ich Wynikiem.} amrap{AMRAP to Skrót Od 'As Many Reps As Possible'. Uczestnicy Muszą Wykonać Jak Najwięcej Powtórzeń Danej Sekwencji Ćwiczeń W Określonym Czasie. Całkowita Liczba Wykonanych Powtórzeń Jest Wynikiem Uczestnika.} emom{EMOM to Skrót Od 'Every Minute on the Minute'. W Tego Typu Treningu Uczestnik Musi Wykonać Ćwiczenia na Początku Każdej Minuty Przez Określoną Liczbę Minut. Każda Minuta Może Mieć Różne Ćwiczenia z Różnymi Wartościami.} other{Nie Znaleziono}}

source: Skip
pl: Pomiń

source: Set done
pl: Ustaw jako zakończone

# titleTargetText
source: {title, select, kg{KG} deg{DEG} m{DISTANCE} sec{TIME} cm{HEIGHT} irm{IRM} lvl{LEVEL} reps{REPS} w{WATT} kcal{CAL} rpm{RPM} other{SPEED}}
pl: {title, select, kg{KG} deg{DEG} m{DŁUGOŚĆ} sec{CZAS} cm{WYSOKOŚĆ} irm{IRM} lvl{POZIOM} reps{POWTÓRZENIA} w{WAT} kcal{KCAL} rpm{RPM} other{PRĘDKOŚĆ}}
